% Тестування метода адаптація кроку
fun = @fun00Lab02; % підпрограма цільової функції
x0 = -3; % початкова точка
xo = 3; % отпимальна точка
h = 3; % початковий крок
e = 1e-2; % допустима похибка
N = 100; % межова кількість точок

% Виклик метода адаптації кроку
[P,F,i,x,fx] = metStepAdaptation(fun,x0,h,e,N);
P(i+1:N) = []; F(i+1:N) = [];
disp(['fx = ' num2str(fx) ' x = ' num2str(x)])
[dfx,d2fx] = der2(fun,x,fx);
disp(['dfx = ' num2str(dfx) ' d2fx = ' num2str(d2fx)])
% побудова графіка процесу
graphfun1(fun,P,F)
