function [P,F,i,c,fc] = metD2(fun,P,F,i,a,b,e)
% Метод ділення інтервалу навпіл (Division 2)
% Вхідні параметри:
% fun - підпрограма обчислення функції
% P - масив усіх точок пошуку
% F – масив значень функції
% i - кількість точок пошуку
% a, b - кінці інтервалу невизначеності
% e - допустима помилка
% Вихідні параметри:
% P - масив усіх точок пошуку
% F - масив значень функції
% i - кількість точок пошуку
% c, fc - кінцева точка пошуку
displ(' Метод ділення інтервалу навпіл')
line2sn(35)
displ('    i  L        fx         x')
line2sn(35)
c = (a + b)/2;
fc = fun(c); % середина інтервалу
i = i + 1; P(:,i) = c; F(i) = fc;
L = c - a;
displ([i2s5(i) r2s10(L) r2s10(fc) r2s10(c)])
while L > e % Цикл метода
 u = (a + c)/2; fu = fun(u); L = c - a;
 i = i + 1; P(i) = u; F(i) = fu;
 displ([i2s5(i) r2s10(L) r2s10(fu) r2s10(u)])
 if fu < fc % зміщення правого кінця інтервалу
 b = c; c = u; fc = fu;
 else
 v = (c + b)/2; fv = fun(v);
 i = i + 1; P(i) = v; F(i) = fv;
 displ([i2s5(i) r2s10(L) r2s10(fv) r2s10(v)])
 if fv < fc % зміщення лівого кінця інтервалу
 a = c; c = v; fc = fv;
 else % зміщення інтервала у центр
 a = u; b = v;
 end
 end
end
line2sn(35)
displ(['i = ' num2str(i) ' L = ' num2str(L)])